src/AccumulationRegisters/ЗапасыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ЗапасыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ЗапасыНаСкладах/Ext/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

#Область ОбработчикиСобытий

&НаСервере
// Процедура - обработчик события ПередЗаписью набора записей.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;

	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Установка исключительной блокировки текущего набора записей регистратора.
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗапасыНаСкладах.НаборЗаписей");
	#Если НЕ МобильноеПриложениеСервер Тогда
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	#КонецЕсли
	ЭлементБлокировки.УстановитьЗначение("Регистратор", Отбор.Регистратор.Значение);
	Блокировка.Заблокировать();
	
	Если НЕ СтруктураВременныеТаблицы.Свойство("ДвиженияЗапасыНаСкладахИзменение") ИЛИ
		СтруктураВременныеТаблицы.Свойство("ДвиженияЗапасыНаСкладахИзменение") И НЕ СтруктураВременныеТаблицы.ДвиженияЗапасыНаСкладахИзменение Тогда
		
		// Если временная таблица "ДвиженияЗапасыНаСкладахИзменение" не существует или не содержит записей
		// об изменении набора, значит набор записывается первый раз или для набора был выполнен контроль остатков.
		// Текущее состояние набора помещается во временную таблицу "ДвиженияЗапасыНаСкладахПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно текущего.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ   РАЗРЕШЕННЫЕ
		|	ЗапасыНаСкладах.НомерСтроки КАК НомерСтроки,
		|	ЗапасыНаСкладах.Склад КАК Склад,
		|	ЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ЗапасыНаСкладах.Номенклатура КАК Номенклатура,
		|	ЗапасыНаСкладах.Партия КАК Партия,
		|	ВЫБОР
		|		КОГДА ЗапасыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ЗапасыНаСкладах.Количество
		|		ИНАЧЕ -ЗапасыНаСкладах.Количество
		|	КОНЕЦ КАК КоличествоПередЗаписью
		|ПОМЕСТИТЬ ДвиженияЗапасыНаСкладахПередЗаписью
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах КАК ЗапасыНаСкладах
		|ГДЕ
		|	ЗапасыНаСкладах.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	Иначе
		
		// Если временная таблица "ДвиженияЗапасыНаСкладахИзменение" существует и содержит записи
		// об изменении набора, значит набор записывается не первый раз и для набора не был выполнен контроль остатков.
		// Текущее состояние набора и текущее состояние изменений помещаются 
		// во временную таблцу "ДвиженияЗапасыНаСкладахПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно первоначального.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
		|	ДвиженияЗапасыНаСкладахИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияЗапасыНаСкладахИзменение.Склад КАК Склад,
		|	ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура,
		|	ДвиженияЗапасыНаСкладахИзменение.Партия КАК Партия,
		|	ДвиженияЗапасыНаСкладахИзменение.КоличествоПередЗаписью КАК КоличествоПередЗаписью
		|ПОМЕСТИТЬ ДвиженияЗапасыНаСкладахПередЗаписью
		|ИЗ
		|	ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗапасыНаСкладах.НомерСтроки,
		|	ЗапасыНаСкладах.Склад,
		|	ЗапасыНаСкладах.СтруктурнаяЕдиница,
		|	ЗапасыНаСкладах.Номенклатура,
		|	ЗапасыНаСкладах.Партия,
		|	ВЫБОР
		|		КОГДА ЗапасыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ЗапасыНаСкладах.Количество
		|		ИНАЧЕ -ЗапасыНаСкладах.Количество
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах КАК ЗапасыНаСкладах
		|ГДЕ
		|	ЗапасыНаСкладах.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	КонецЕсли;
	
	// Временная таблица "ДвиженияЗапасыНаСкладахИзменение" уничтожается
	// Удаляется информация о ее существовании.
	
	Если СтруктураВременныеТаблицы.Свойство("ДвиженияЗапасыНаСкладахИзменение") Тогда
		
		Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияЗапасыНаСкладахИзменение");
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		СтруктураВременныеТаблицы.Удалить("ДвиженияЗапасыНаСкладахИзменение");
	
	КонецЕсли;

	
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события ПриЗаписи набора записей.
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу "ДвиженияЗапасыНаСкладахИзменение".
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ДвиженияЗапасыНаСкладахИзменение.НомерСтроки) КАК НомерСтроки,
	|	ДвиженияЗапасыНаСкладахИзменение.Склад КАК Склад,
	|	ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура,
	|	ДвиженияЗапасыНаСкладахИзменение.Партия КАК Партия,
	|	СУММА(ДвиженияЗапасыНаСкладахИзменение.КоличествоПередЗаписью) КАК КоличествоПередЗаписью,
	|	СУММА(ДвиженияЗапасыНаСкладахИзменение.КоличествоИзменение) КАК КоличествоИзменение,
	|	СУММА(ДвиженияЗапасыНаСкладахИзменение.КоличествоПриЗаписи) КАК КоличествоПриЗаписи
	|ПОМЕСТИТЬ ДвиженияЗапасыНаСкладахИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияЗапасыНаСкладахПередЗаписью.НомерСтроки КАК НомерСтроки,
	|		ДвиженияЗапасыНаСкладахПередЗаписью.Склад КАК Склад,
	|		ДвиженияЗапасыНаСкладахПередЗаписью.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ДвиженияЗапасыНаСкладахПередЗаписью.Номенклатура КАК Номенклатура,
	|		ДвиженияЗапасыНаСкладахПередЗаписью.Партия КАК Партия,
	|		ДвиженияЗапасыНаСкладахПередЗаписью.КоличествоПередЗаписью КАК КоличествоПередЗаписью,
	|		ДвиженияЗапасыНаСкладахПередЗаписью.КоличествоПередЗаписью КАК КоличествоИзменение,
	|		0 КАК КоличествоПриЗаписи
	|	ИЗ
	|		ДвиженияЗапасыНаСкладахПередЗаписью КАК ДвиженияЗапасыНаСкладахПередЗаписью
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияЗапасыНаСкладахПриЗаписи.НомерСтроки,
	|		ДвиженияЗапасыНаСкладахПриЗаписи.Склад,
	|		ДвиженияЗапасыНаСкладахПриЗаписи.СтруктурнаяЕдиница,
	|		ДвиженияЗапасыНаСкладахПриЗаписи.Номенклатура,
	|		ДвиженияЗапасыНаСкладахПриЗаписи.Партия,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияЗапасыНаСкладахПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияЗапасыНаСкладахПриЗаписи.Количество
	|			ИНАЧЕ ДвиженияЗапасыНаСкладахПриЗаписи.Количество
	|		КОНЕЦ,
	|		ДвиженияЗапасыНаСкладахПриЗаписи.Количество
	|	ИЗ
	|		РегистрНакопления.ЗапасыНаСкладах КАК ДвиженияЗапасыНаСкладахПриЗаписи
	|	ГДЕ
	|		ДвиженияЗапасыНаСкладахПриЗаписи.Регистратор = &Регистратор) КАК ДвиженияЗапасыНаСкладахИзменение
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияЗапасыНаСкладахИзменение.Склад,
	|	ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница,
	|	ДвиженияЗапасыНаСкладахИзменение.Номенклатура,
	|	ДвиженияЗапасыНаСкладахИзменение.Партия
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДвиженияЗапасыНаСкладахИзменение.КоличествоИзменение) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад,
	|	Номенклатура,
	|	Партия");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	// Новые изменения были помещены во временную таблицу "ДвиженияЗапасыНаСкладахИзменение".
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияЗапасыНаСкладахИзменение", ВыборкаИзРезультатаЗапроса.Количество > 0);
	
	// Временная таблица "ДвиженияЗапасыНаСкладахПередЗаписью" уничтожается
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияЗапасыНаСкладахПередЗаписью");
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти
